# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'shivammathur/php'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'wget'
brew 'httpie'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn' # Needed to install fonts
brew 'zsh-autosuggestions'

# Install node
brew 'nvm'

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'shivammathur/php/php'
brew 'shivammathur/php/php@8.0'
brew 'shivammathur/php/php@7.4'
brew 'composer'
brew 'imagemagick'
brew 'meilisearch'
brew 'nginx'
brew 'redis'
brew 'yarn'
brew 'ghostscript'

# Apps
cask '1password'
cask 'dbngin'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'fork'
cask 'google-chrome'
cask 'imageoptim'
cask 'iterm2'
cask 'phpmon'
cask 'phpstorm'
cask 'rectangle'
cask 'slack'
cask 'sublime-text'
cask 'tableplus'
cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'transmission'
cask 'tinkerwell'
cask 'visual-studio-code'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-ibm-plex'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Harvest', id: 506189836
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825