# Dotfiles Brewfile
# Install with: brew bundle --file=~/.dotfiles/Brewfile

# Core tools
brew "node"
brew "php"
brew "composer"
brew "pkg-config"
brew "wget"
brew "httpie"
brew "ncdu"
brew "hub"
brew "gh"
brew "ack"
brew "doctl"
cask "1password-cli"
brew "git-secret"
brew "imagemagick"
brew "mysql"
brew "yarn"
brew "ghostscript"
brew "mackup"

# Zsh
brew "zsh-autosuggestions"

# Modern CLI tools
brew "starship"
brew "zoxide"
brew "bat"
brew "eza"
brew "ripgrep"
brew "fd"
brew "git-delta"
brew "fnm"
brew "fzf"
brew "direnv"
brew "jq"
brew "yq"
brew "bottom"

# Development tools
cask "claude-code"
cask "zed"

# Fonts
cask "font-meslo-lg-nerd-font"
cask 'font-ibm-plex'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# QuickLook plugins
cask "qlcolorcode"
cask "qlstephen"
cask "qlmarkdown"
cask "quicklook-json"
cask "qlprettypatch"
cask "quicklook-csv"
cask "betterzip"
cask "suspicious-package"

# Apps
cask '1password'
cask 'dbngin'
cask 'orbstack'
cask 'figma'
cask 'firefox'
cask 'fork'
cask 'thebrowsercompany-dia'
cask 'google-chrome'
cask 'imageoptim'
cask 'iterm2'
cask 'phpmon'
cask 'rectangle'
cask 'slack'
cask 'sublime-text'
cask 'tableplus'
cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'transmission'
cask 'tinkerwell'
